#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
    
    // регистр ОстаткиДенежныхСредств Расход
    Движения.ОстаткиДенежныхСредств.Записывать = Истина;
    Движение = Движения.ОстаткиДенежныхСредств.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
    Движение.Период = Дата;
    Движение.ТорговаяПлощадка = ТорговаяПлощадка;
    Движение.Брокер = Брокер;
    Движение.Счет = Счет;
    Движение.Сумма = Сумма;

    // регистр БалансоваяСтоимостьБумаг Приход
    Движения.БалансоваяСтоимостьБумаг.Записывать = Истина;
    Движение = Движения.БалансоваяСтоимостьБумаг.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    Движение.Период = Дата;
    Движение.ТорговаяПлощадка = ТорговаяПлощадка;
    Движение.Брокер = Брокер;
    Движение.Бумага = Бумага;
    Движение.ДокументПриобритения = Ссылка;
    Движение.Количество = Количество;
    Движение.Сумма = Сумма;

    // регистр Затраты 
    Движения.Затраты.Записывать = Истина;
    Движение = Движения.Затраты.Добавить();
    Движение.Период = Дата;
    Движение.ТорговаяПлощадка = ТорговаяПлощадка;
    Движение.Брокер = Брокер;
    Движение.Бумага = Бумага;
    Движение.ТипЗатрат = Перечисления.ТипыЗатрат.ЗатратыНаПриобритение;
    Движение.Сумма = Сумма;
    //Комиссия
    Движение = Движения.Затраты.Добавить();
    Движение.Период = Дата;
    Движение.ТорговаяПлощадка = ТорговаяПлощадка;
    Движение.Брокер = Брокер;
    Движение.Бумага = Бумага;
    Движение.ТипЗатрат = Перечисления.ТипыЗатрат.КомиссияБрокера;
    Движение.Сумма = Комиссия;

КонецПроцедуры

#КонецОбласти
    
#КонецЕсли