
#Область Заголовок
// Модуль расчета и отражения денежных средств.
#КонецОбласти

#Область ПрограммныйИнтерфейс
/// <Формирование движений по регистру ОстаткиДенежныхСредств>
//
// Параметры:
//  <Источник>  - <ДокументОбъект> - <документ который проводится по регистру Остатки денежных средств>
//  <Отказ>  - <Булево> - <признак отказа от формирования движений в случае ошибок>
//
Процедура ДвиженияПоДенежнымСредствам(Источник, Отказ) Экспорт
    
    Движения = Источник.Движения;
    
    // Затраты на приобритение
    Движения.ОстаткиДенежныхСредств.Записывать = Истина;
    Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПокупкаЦенныхБумаг") 
        Или ТипЗнч(Источник) = Тип("ДокументОбъект.ВыводСредств") Тогда
        Движение = Движения.ОстаткиДенежныхСредств.ДобавитьРасход();
    ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПродажаЦенныхБумаг")
        Или ТипЗнч(Источник) = Тип("ДокументОбъект.ВводСредств") Тогда
        Движение = Движения.ОстаткиДенежныхСредств.ДобавитьПриход();
    Иначе
        Возврат;
    КонецЕсли;    
    ЗаполнитьЗначенияСвойств(Движение, Источник);
    Движение.Период = Источник.Дата;
    
    Если Источник.Комиссия > 0 Тогда
        // регистр ОстаткиДенежныхСредств Расход 
        Движение = Движения.ОстаткиДенежныхСредств.ДобавитьРасход();
        ЗаполнитьЗначенияСвойств(Движение, Источник);
        Движение.Период     = Источник.Дата;
        Движение.Сумма      = Источник.Комиссия;
    КонецЕсли;
    
КонецПроцедуры // ДвиженияПоЗатратам()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
//Раздел предназначен для модулей, которые являются
//частью некоторой функциональной подсистемы. В нем должны быть размещены экспортные процедуры
//и функции, которые допустимо вызывать только из других функциональных подсистем этой же
//библиотеки.
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Раздел содержит процедуры и функции, составляющие
//внутреннюю реализацию общего модуля. В тех случаях, когда общий модуль является частью
//некоторой функциональной подсистемы, включающей в себя несколько объектов метаданных, в этом
//разделе также могут быть размещены служебные экспортные процедуры и функции,
//предназначенные только для вызова из других объектов данной подсистемы. 
//
//Для объемных общих модулей рекомендуется разбивать этот раздел на подразделы, по
//функциональному признаку.
#КонецОбласти
 