#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ОбработчикиСобытий
    
Процедура ОбработкаПроведения(Отказ, Режим)
        
    // регистр ОстаткиДенежныхСредств Приход
    Движения.ОстаткиДенежныхСредств.Записывать = Истина;
    Движение = Движения.ОстаткиДенежныхСредств.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    Движение.Период = Дата;
    Движение.ТорговаяПлощадка = ТорговаяПлощадка;
    Движение.Брокер = Брокер;
    Движение.Счет = Счет;
    Движение.Сумма = Сумма - Комиссия;

КонецПроцедуры
    
#КонецОбласти
    
#КонецЕсли