
#Область Заголовок
// Модуль расчета и отражения доходов.
#КонецОбласти

#Область ПрограммныйИнтерфейс
//Раздел содержит экспортные процедуры и функции, предназначенные
//для использования другими объектами конфигурации или другими программами (например, через
//внешнее соединение).

// <Формирование движений по регистру Доходы>
//
// Параметры:
//  <Источник>  - <ДокументОбъект> - <документ который проводится по регистру доходов>
//  <Отказ>  - <Булево> - <признак отказа от формирования движений в случае ошибок>
//
Процедура ДвиженияПоДоходам(Источник, Отказ) Экспорт
    
    Движения = Источник.Движения;
    Движения.Доходы.Записывать = Истина;
    // Затраты на приобритение 
    Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПродажаЦенныхБумаг") Тогда 
        Движение = Движения.Доходы.Добавить();
        ЗаполнитьЗначенияСвойств(Движение, Источник);
        Движение.Период     = Источник.Дата;
        Движение.ТипДоходов  = Перечисления.ТипыДоходов.ДоходыОтПродажи;
    КонецЕсли;
     
КонецПроцедуры // ДвиженияПоДоходам()
 
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
//Раздел предназначен для модулей, которые являются
//частью некоторой функциональной подсистемы. В нем должны быть размещены экспортные процедуры
//и функции, которые допустимо вызывать только из других функциональных подсистем этой же
//библиотеки.
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Раздел содержит процедуры и функции, составляющие
//внутреннюю реализацию общего модуля. В тех случаях, когда общий модуль является частью
//некоторой функциональной подсистемы, включающей в себя несколько объектов метаданных, в этом
//разделе также могут быть размещены служебные экспортные процедуры и функции,
//предназначенные только для вызова из других объектов данной подсистемы. 
//
//Для объемных общих модулей рекомендуется разбивать этот раздел на подразделы, по
//функциональному признаку.
 
#КонецОбласти
 