&НаСервереБезКонтекста
Функция КратностьБумаги(Бумага)
    
    Возврат Бумага.Кратность;
    
КонецФункции

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
    
    РеквизитыРасчета = Новый Структура();
    РеквизитыРасчета.Вставить("Цена", Объект.Цена);
    РеквизитыРасчета.Вставить("Количество", Объект.Количество);
    Объект.Сумма = ЗаполнениеДокументовСервер.РасчетПоРеквизитам(РеквизитыРасчета, "РасчетСуммы");
    
    РеквизитыРасчета = Новый Структура();
    РеквизитыРасчета.Вставить("ТорговаяПлощадка", Объект.ТорговаяПлощадка);
    РеквизитыРасчета.Вставить("Брокер", Объект.Брокер);
    РеквизитыРасчета.Вставить("ДатаСреза", Объект.Дата);
    РеквизитыРасчета.Вставить("Бумага", Объект.Бумага);
    РеквизитыРасчета.Вставить("Сумма", Объект.Сумма);  
    Объект.Комиссия = ЗаполнениеДокументовСервер.РасчетПоРеквизитам(РеквизитыРасчета, "РасчетКомиссии");
    
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
    
    РеквизитыРасчета = Новый Структура();
    РеквизитыРасчета.Вставить("Цена", Объект.Цена);
    РеквизитыРасчета.Вставить("Количество", Объект.Количество);
    Объект.Сумма = ЗаполнениеДокументовСервер.РасчетПоРеквизитам(РеквизитыРасчета, "РасчетСуммы");
    
    РеквизитыРасчета = Новый Структура();
    РеквизитыРасчета.Вставить("ТорговаяПлощадка", Объект.ТорговаяПлощадка);
    РеквизитыРасчета.Вставить("Брокер", Объект.Брокер);
    РеквизитыРасчета.Вставить("ДатаСреза", Объект.Дата);
    РеквизитыРасчета.Вставить("Бумага", Объект.Бумага);
    РеквизитыРасчета.Вставить("Сумма", Объект.Сумма);  
    Объект.Комиссия = ЗаполнениеДокументовСервер.РасчетПоРеквизитам(РеквизитыРасчета, "РасчетКомиссии");
    
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
    
    РеквизитыРасчета = Новый Структура();
    РеквизитыРасчета.Вставить("Сумма", Объект.Сумма);
    РеквизитыРасчета.Вставить("Количество", Объект.Количество);
    Объект.Цена = ЗаполнениеДокументовСервер.РасчетПоРеквизитам(РеквизитыРасчета, "РасчетЦены");
    
    РеквизитыРасчета = Новый Структура();
    РеквизитыРасчета.Вставить("ТорговаяПлощадка", Объект.ТорговаяПлощадка);
    РеквизитыРасчета.Вставить("Брокер", Объект.Брокер);
    РеквизитыРасчета.Вставить("ДатаСреза", Объект.Дата);
    РеквизитыРасчета.Вставить("Бумага", Объект.Бумага);
    РеквизитыРасчета.Вставить("Сумма", Объект.Сумма);  
    Объект.Комиссия = ЗаполнениеДокументовСервер.РасчетПоРеквизитам(РеквизитыРасчета, "РасчетКомиссии");
    
КонецПроцедуры

&НаКлиенте
Процедура КоличествоРегулирование(Элемент, Направление, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    Объект.Количество = Объект.Количество + КратностьБумаги(Объект.Бумага) * Направление;
    КоличествоПриИзменении(Неопределено);
    Модифицированность = Истина;
    
    РеквизитыРасчета = Новый Структура();
    РеквизитыРасчета.Вставить("ТорговаяПлощадка", Объект.ТорговаяПлощадка);
    РеквизитыРасчета.Вставить("Брокер", Объект.Брокер);
    РеквизитыРасчета.Вставить("ДатаСреза", Объект.Дата);
    РеквизитыРасчета.Вставить("Бумага", Объект.Бумага);
    РеквизитыРасчета.Вставить("Сумма", Объект.Сумма);  
    Объект.Комиссия = ЗаполнениеДокументовСервер.РасчетПоРеквизитам(РеквизитыРасчета, "РасчетКомиссии");
    
КонецПроцедуры

&НаКлиенте
Процедура ТорговаяПлощадкаПриИзменении(Элемент)
    
    РеквизитыРасчета = Новый Структура();
    РеквизитыРасчета.Вставить("ТорговаяПлощадка", Объект.ТорговаяПлощадка);
    РеквизитыРасчета.Вставить("Брокер", Объект.Брокер);
    РеквизитыРасчета.Вставить("ДатаСреза", Объект.Дата);
    РеквизитыРасчета.Вставить("Бумага", Объект.Бумага);
    РеквизитыРасчета.Вставить("Сумма", Объект.Сумма);  
    Объект.Комиссия = ЗаполнениеДокументовСервер.РасчетПоРеквизитам(РеквизитыРасчета, "РасчетКомиссии");
    
КонецПроцедуры

&НаКлиенте
Процедура БрокерПриИзменении(Элемент)
    
    РеквизитыРасчета = Новый Структура();
    РеквизитыРасчета.Вставить("ТорговаяПлощадка", Объект.ТорговаяПлощадка);
    РеквизитыРасчета.Вставить("Брокер", Объект.Брокер);
    РеквизитыРасчета.Вставить("ДатаСреза", Объект.Дата);
    РеквизитыРасчета.Вставить("Бумага", Объект.Бумага);
    РеквизитыРасчета.Вставить("Сумма", Объект.Сумма);  
    Объект.Комиссия = ЗаполнениеДокументовСервер.РасчетПоРеквизитам(РеквизитыРасчета, "РасчетКомиссии");
    
КонецПроцедуры

&НаКлиенте
Процедура БумагаПриИзменении(Элемент)
    
    РеквизитыРасчета = Новый Структура();
    РеквизитыРасчета.Вставить("ТорговаяПлощадка", Объект.ТорговаяПлощадка);
    РеквизитыРасчета.Вставить("Брокер", Объект.Брокер);
    РеквизитыРасчета.Вставить("ДатаСреза", Объект.Дата);
    РеквизитыРасчета.Вставить("Бумага", Объект.Бумага);
    РеквизитыРасчета.Вставить("Сумма", Объект.Сумма);  
    Объект.Комиссия = ЗаполнениеДокументовСервер.РасчетПоРеквизитам(РеквизитыРасчета, "РасчетКомиссии");
    
КонецПроцедуры
