&НаСервереБезКонтекста
Функция КратностьБумаги(Бумага)
    Возврат Бумага.Кратность;
КонецФункции

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
    РеквизитыРасчета = Новый Структура();
    РеквизитыРасчета.Вставить("Цена", Объект.Цена);
    РеквизитыРасчета.Вставить("Количество", Объект.Количество);
    Объект.Сумма = ОбработкаТабличныхЧастейСервер.РасчетПоРеквизитам(РеквизитыРасчета, "РасчетСуммы");
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
    РеквизитыРасчета = Новый Структура();
    РеквизитыРасчета.Вставить("Цена", Объект.Цена);
    РеквизитыРасчета.Вставить("Количество", Объект.Количество);
    Объект.Сумма = ОбработкаТабличныхЧастейСервер.РасчетПоРеквизитам(РеквизитыРасчета, "РасчетСуммы");
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
    РеквизитыРасчета = Новый Структура();
    РеквизитыРасчета.Вставить("Сумма", Объект.Сумма);
    РеквизитыРасчета.Вставить("Количество", Объект.Количество);
    Объект.Цена = ОбработкаТабличныхЧастейСервер.РасчетПоРеквизитам(РеквизитыРасчета, "РасчетЦены");
КонецПроцедуры

&НаКлиенте
Процедура КоличествоРегулирование(Элемент, Направление, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
    Объект.Количество = Объект.Количество + КратностьБумаги(Объект.Бумага) * Направление;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если Объект.Ссылка.Пустая() Тогда
        ЗаполнениеДокументовСервер.ЗаполнитьШапкуДокумента(Объект);
    КонецЕсли; 
КонецПроцедуры