
&НаКлиенте
Процедура ЗагрузитьДанныеПоЦеннымБумагам(Команда)   
    
    СообщенияОбОшибках = "";
    МассивЦенныхБумаг = Новый Массив;
    МассивЦенныхБумаг.Добавить(Инструмент);
    
    ЗагрузитьДанныеКотировок(МассивЦенныхБумаг, ДатаНачала, ДатаОкончания, ТипВыборки, ТорговаяПлощадка, СообщенияОбОшибках);
    
    Если  СообщенияОбОшибках <> "" Тогда
        
        Сообщить(СообщенияОбОшибках, СтатусСообщения.ОченьВажное);
        
    КонецЕсли; 
    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ДатаОкончания = ТекущаяДата();
    ДатаНачала = НачалоМесяца(ДатаОкончания);
    ТипВыборки = Перечисления.ТипыПериода.ОдинДень;
    
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеКотировок(МассивЦенныхБумаг, ДатаНачала, ДатаОкончания, ТипВыборки, ТорговаяПлощадка, СообщенияОбОшибках)

	 ЦенныеБумагиСервер.ЗагрузитьДанныеКотировок(МассивЦенныхБумаг, ДатаНачала, ДатаОкончания, ТипВыборки, ТорговаяПлощадка, СообщенияОбОшибках);

КонецПроцедуры
 